# DBDocRemoveConn

## Description
Remove a database connection from the current document

```pascal
FUNCTION DBDocRemoveConn(databaseName : DYNARRAY[] of CHAR): BOOLEAN;
```

```python
def vs.DBDocRemoveConn(databaseName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|databaseName|DYNARRAY[] of CHAR|   |

## Version
Availability: from Vectorworks 2011

## Category
* ODBC